Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
/*
 * Copyright (c) 2016-2018  Moddable Tech, Inc.
 *
 *   This file is part of the Moddable SDK Runtime.
 * 
 *   The Moddable SDK Runtime is free software: you can redistribute it and/or modify
 *   it under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or
 *   (at your option) any later version.
 * 
 *   The Moddable SDK Runtime is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU Lesser General Public License for more details.
 * 
 *   You should have received a copy of the GNU Lesser General Public License
 *   along with the Moddable SDK Runtime.  If not, see <http://www.gnu.org/licenses/>.
 *
 */
/*
	TBD:
		- 128-bit UUIDs
 */

#include "xsmc.h"
#include "xsHost.h"
#include "mc.xs.h"
#include "mc.defines.h"
#include "modBLE.h"

#include "sdk_errors.h"
#include "ble.h"
#include "ble_conn_params.h"
#include "ble_gap.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_freertos.h"
#include "nrf_ble_gatt.h"
#include "nrf_sdh.h"

#define APP_BLE_CONN_CFG_TAG 1
#define APP_BLE_OBSERVER_PRIO 3
#define FIRST_CONN_PARAMS_UPDATE_DELAY      5000                                    /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY       30000                                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define LOG_GATTS 0
#if LOG_GATTS
	#define LOG_GATTS_EVENT(event) logGATTSEvent(event)
	#define LOG_GATTS_MSG(msg) modLog(msg)
	#define LOG_GATTS_INT(i) modLogInt(i)
#else
	#define LOG_GATTS_EVENT(event)
	#define LOG_GATTS_MSG(msg)
	#define LOG_GATTS_INT(i)
#endif

#define LOG_GAP 0
#if LOG_GAP
	#define LOG_GAP_EVENT(event) logGAPEvent(event)
	#define LOG_GAP_MSG(msg) modLog(msg)
	#define LOG_GAP_INT(i) modLogInt(i)
#else
	#define LOG_GAP_EVENT(event)
	#define LOG_GAP_MSG(msg)
	#define LOG_GAP_INT(i)
#endif

#define GATT_CHAR_PROP_BIT_READ		(1 << 1)
#define GATT_CHAR_PROP_BIT_WRITE_NR	(1 << 2)
#define GATT_CHAR_PROP_BIT_WRITE	(1 << 3)
#define GATT_CHAR_PROP_BIT_NOTIFY	(1 << 4)
#define GATT_CHAR_PROP_BIT_INDICATE	(1 << 5)
#define GATT_CHAR_PROP_BIT_AUTH		(1 << 6)
#define GATT_CHAR_PROP_BIT_EXT_PROP	(1 << 7)

#define GATT_PERM_READ				(1 << 0)
#define GATT_PERM_READ_ENCRYPTED	(1 << 1)
#define GATT_PERM_WRITE				(1 << 4)
#define GATT_PERM_WRITE_ENCRYPTED	(1 << 5)

#define CHAR_DECLARATION_SIZE		(sizeof(uint8_t))
#define UUID_LEN_16		2
#define UUID_LEN_32		4
#define UUID_LEN_128	16

#define DEVICE_FRIENDLY_NAME "Moddable"

typedef struct {
	uint16_t uuid_length;
	uint8_t  *uuid_p;
	uint16_t perm;
	uint16_t max_length;
	uint16_t length;
	uint8_t  *value;
} attr_desc_t;

typedef struct {
#define GATT_RSP_BY_APP 0
#define GATT_AUTO_RSP 1
	uint8_t auto_rsp;
} attr_control_t;

typedef struct {
	attr_control_t attr_control;
	attr_desc_t att_desc;
} gatts_attr_db_t;

typedef struct {
	uint8_t service_index;
	uint8_t att_index;
	ble_gatts_char_handles_t handles;
} gatts_handles_t;

static const uint16_t primary_service_uuid = 0x2800;
static const uint16_t character_declaration_uuid = 0x2803;
static const uint16_t character_client_config_uuid = 0x2902;

#include "mc.bleservices.c"

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void bleServerCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void bleServerReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsReadAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapAuthStatusEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsWriteAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static const char_name_table *handleToCharName(uint16_t handle);
static void uuidToBuffer(uint8_t *buffer, ble_uuid_t *uuid, uint16_t *length);

typedef struct {
	xsMachine *the;
	xsSlot obj;

	uint8_t deviceNameSet;

	// connection
	uint16_t conn_handle;
	ble_gap_addr_t remote_bda;
	
	// gatt
	nrf_ble_gatt_t m_gatt;
	
	// advertising
	uint8_t adv_handle_initialized;
	uint8_t adv_handle;
	uint8_t adv_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
	uint8_t scan_rsp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
	
	// security
	uint8_t encryption;
	uint8_t bonding;
	uint8_t mitm;
	uint8_t iocap;
	uint8_t bond;
	bool erase_bonds;
} modBLERecord, *modBLE;

static modBLE gBLE = NULL;

#if MODDEF_BLE_MAX_CONNECTIONS != 1
	#error - only one ble client connection supported
#endif

void xs_ble_server_initialize(xsMachine *the)
{
	uint32_t ram_start = 0;
    ble_conn_params_init_t cp_init;
    ret_code_t err_code;
    
	if (NULL != gBLE)
		xsUnknownError("BLE already initialized");
	gBLE = (modBLE)c_calloc(sizeof(modBLERecord), 1);
	if (!gBLE)
		xsUnknownError("no memory");
	gBLE->conn_handle = BLE_CONN_HANDLE_INVALID;
	gBLE->adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	gBLE->bond = 0xFF;
	gBLE->the = the;
	gBLE->obj = xsThis;
	xsmcSetHostData(xsThis, gBLE);
	xsRemember(gBLE->obj);
	
	// Initialize platform Bluetooth modules
    err_code = nrf_sdh_enable_request();
    if (NRF_SUCCESS == err_code) {
		// Configure the BLE stack using the default settings.
		// Fetch the start address of the application RAM.
		err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    }

