Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
    // Enable BLE stack
    if (NRF_SUCCESS == err_code)
    	err_code = nrf_sdh_ble_enable(&ram_start);

	// Initialize GATT module
    if (NRF_SUCCESS == err_code)
		err_code = nrf_ble_gatt_init(&gBLE->m_gatt, NULL);
    
	// Initialize connection parameters (required)
    if (NRF_SUCCESS == err_code) {
		c_memset(&cp_init, 0, sizeof(cp_init));
		cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
		cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
		cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
		err_code = ble_conn_params_init(&cp_init);
    }

	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble initialization failed");

    // Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    // Create a FreeRTOS task for the BLE stack.
	nrf_sdh_freertos_init(NULL, &gBLE->erase_bonds);
    
	modMessagePostToMachine(the, NULL, 0, bleServerReadyEvent, NULL);
}

void xs_ble_server_close(xsMachine *the)
{
	modBLE ble = xsmcGetHostData(xsThis);
	if (!ble) return;

	gBLE = NULL;
	xsForget(gBLE->obj);
	xsmcSetHostData(xsThis, NULL);
	modMessagePostToMachine(ble->the, NULL, 0, bleServerCloseEvent, ble);
}

void xs_ble_server_destructor(void *data)
{
	modBLE ble = data;
	if (!ble) return;

	if (-1 != ble->conn_handle)
		sd_ble_gap_disconnect(ble->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	
	c_free(ble);
	gBLE = NULL;

	nrf_sdh_disable_request();
}

void xs_ble_server_disconnect(xsMachine *the)
{
	if (BLE_CONN_HANDLE_INVALID != gBLE->conn_handle)
		sd_ble_gap_disconnect(gBLE->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void xs_ble_server_get_local_address(xsMachine *the)
{
    ret_code_t err_code;
    ble_gap_addr_t addr;
    
	err_code = sd_ble_gap_addr_get(&addr);
	if (NRF_SUCCESS == err_code) {
		xsmcSetArrayBuffer(xsResult, (void*)&addr.addr[0], 6);
	}
}

void xs_ble_server_set_device_name(xsMachine *the)
{
    ret_code_t err_code;
	ble_gap_conn_sec_mode_t sec_mode;
	const char *name = xsmcToString(xsArg(0));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, name, c_strlen(name));
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble set device name failed");

	gBLE->deviceNameSet = 1;
}

void xs_ble_server_start_advertising(xsMachine *the)
{
    ret_code_t err_code;
	ble_gap_adv_data_t adv_data;
	ble_gap_adv_params_t adv_params;
	
	uint16_t intervalMin = xsmcToInteger(xsArg(0));
	uint16_t intervalMax = xsmcToInteger(xsArg(1));
	uint8_t *advertisingData = (uint8_t*)xsmcToArrayBuffer(xsArg(2));
	uint32_t advertisingDataLength = xsGetArrayBufferLength(xsArg(2));
	uint8_t *scanResponseData = xsmcTest(xsArg(3)) ? (uint8_t*)xsmcToArrayBuffer(xsArg(3)) : NULL;
	uint32_t scanResponseDataLength = xsmcTest(xsArg(3)) ? xsGetArrayBufferLength(xsArg(3)) : 0;

    c_memset(&adv_data, 0, sizeof(ble_gap_adv_data_t));
	c_memmove(&gBLE->adv_data[0], advertisingData, advertisingDataLength);
	adv_data.adv_data.p_data = &gBLE->adv_data[0];
	adv_data.adv_data.len = advertisingDataLength;
	if (NULL != scanResponseData) {
		c_memmove(&gBLE->scan_rsp_data[0], scanResponseData, scanResponseDataLength);
		adv_data.scan_rsp_data.p_data = &gBLE->scan_rsp_data[0];
		adv_data.scan_rsp_data.len = scanResponseDataLength;
	}

    c_memset(&adv_params, 0, sizeof(ble_gap_adv_params_t));
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    adv_params.interval        = intervalMin;

	err_code = sd_ble_gap_adv_set_configure(&gBLE->adv_handle, &adv_data, &adv_params);
	if (NRF_SUCCESS == err_code)
		err_code = sd_ble_gap_adv_start(gBLE->adv_handle, APP_BLE_CONN_CFG_TAG);
	
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble start advertising failed");
}
	
void xs_ble_server_stop_advertising(xsMachine *the)
{
    ret_code_t err_code;
    
	err_code = sd_ble_gap_adv_stop(gBLE->adv_handle);
	if (NRF_ERROR_INVALID_STATE != err_code)
		xsUnknownError("ble stop advertising failed");
}

void xs_ble_server_characteristic_notify_value(xsMachine *the)
{
	uint16_t handle = xsmcToInteger(xsArg(0));
	uint16_t notify = xsmcToInteger(xsArg(1));
	ble_gatts_hvx_params_t hvx_params;
	uint16_t hvx_len = xsGetArrayBufferLength(xsArg(2));
	ret_code_t err_code;

	c_memset(&hvx_params, 0, sizeof(hvx_params));
	hvx_params.handle = handle;
	hvx_params.type   = (notify ? BLE_GATT_HVX_NOTIFICATION : BLE_GATT_HVX_INDICATION);
	hvx_params.offset = 0;
	hvx_params.p_len  = &hvx_len;
	hvx_params.p_data = xsmcToArrayBuffer(xsArg(2));
	err_code = sd_ble_gatts_hvx(gBLE->conn_handle, &hvx_params);
}

void xs_ble_server_deploy(xsMachine *the)
{
    ret_code_t err_code = NRF_SUCCESS;
    ble_uuid_t ble_uuid;
    ble_add_char_params_t add_char_params;
    ble_add_descr_params_t add_desc_params;
	uint8_t permissions;
	uint16_t properties;
	uint16_t char_handle;
	uint16_t att_handle_index = 0;
					
	for (uint16_t i = 0; i < service_count; ++i) {
		gatts_attr_db_t *gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][0];
		attr_desc_t *att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
		uint8_t uuid_type;
		
		if (UUID_LEN_16 == att_desc->uuid_length && 0x00 == att_desc->value[0] && 0x18 == att_desc->value[1])
			continue;	// don't register gap service
			
		if (UUID_LEN_16 == att_desc->length) {
			uint16_t service_uuid = *(uint16_t*)att_desc->value;
			BLE_UUID_BLE_ASSIGN(ble_uuid, service_uuid);
		}
		else if (UUID_LEN_128 == att_desc->length) {
			err_code = sd_ble_uuid_vs_add((ble_uuid128_t const *)att_desc->value, &uuid_type);
		}
		else
			xsUnknownError("unsupported uuid size");

		err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &service_handles[i]);
		for (uint16_t j = 1; (NRF_SUCCESS == err_code) && (j < attribute_counts[i]); ++j) {
			gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][j];
			att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
			if (0 == c_memcmp(att_desc->uuid_p, &character_declaration_uuid, sizeof(character_declaration_uuid))) {
				properties = *att_desc->value;
				
				++j;	// advance to characteristic value
				gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][j];
				att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
				permissions = att_desc->perm;
				
				c_memset(&add_char_params, 0, sizeof(add_char_params));
				add_char_params.uuid			= *(uint16_t*)att_desc->uuid_p;
				add_char_params.max_len			= att_desc->max_length;
				add_char_params.init_len		= att_desc->length;
				add_char_params.p_init_value	= att_desc->value;
				add_char_params.is_var_len		= false;
				add_char_params.is_defered_read = (NULL == att_desc->value);
				
